::  unicode utilities
::
|%
++  confusable
  |%
  ::  +con-sig: confusable with '~'
  ++  con-sig  ^~
     ^-  (set @t)
     %-  silt
     :~  '῀'
         '⁓'
         '˜'
         '∼'
         '~'
     ==
  ::  +con-hep: confusable '-'
  ++  con-hep
    ^~
    ^-  (set @t)
    %-  silt
    :~  '‐'
        '‑'
        '‒'
        '−'
        '–'
        '⁃'
        '۔'
        '➖'
        '˗'
        '﹘'
        'Ⲻ'
        '-'
    ==

  ::  +con-a: confusable with 'a'
  ++  con-a
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝝰'
        'a'
        'ａ'
        '𝑎'
        '𝗮'
        '𝕒'
        '𝖆'
        '𝓪'
        '𝚊'
        '𝞪'
        'а'
        'ɑ'
        'α'
        '𝔞'
        '𝒂'
        '𝘢'
        '𝛂'
        '⍺'
        '𝒶'
        '𝙖'
        '𝜶'
        '𝛼'
        '𝐚'
        '𝖺'
    ==
  ::  +con-b: confusable with 'b'
  ++  con-b
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝑏'
        '𝗯'
        'b'
        'Ƅ'
        '𝕓'
        '𝖇'
        'Ь'
        '𝓫'
        '𝚋'
        'Ꮟ'
        'ᖯ'
        '𝔟'
        'ᑲ'
        '𝒃'
        '𝘣'
        '𝒷'
        '𝙗'
        '𝐛'
        '𝖻'
    ==
  ::  +con-c: confusable with 'c'
  ++  con-c
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝑐'
        '𝗰'
        'с'
        'c'
        'ｃ'
        '𝕔'
        'ᴄ'
        'ⲥ'
        '𐐽'
        '𝖈'
        '𝓬'
        '𝚌'
        'ꮯ'
        '𝔠'
        'ϲ'
        '𝒄'
        '𝘤'
        '𝒸'
        '𝙘'
        '𝐜'
        '𝖼'
        'ⅽ'
    ==
  ::  +con-d: confusable with 'd'
  ++  con-d
    ^~
    ^-  (set @t)
    %-  silt
    :~  'ԁ'
        '𝓭'
        '𝚍'
        'd'
        'ⅆ'
        '𝑑'
        '𝗱'
        'Ꮷ'
        '𝒅'
        '𝘥'
        '𝖉'
        'ᑯ'
        'ꓒ'
        '𝐝'
        '𝖽'
        '𝔡'
        '𝕕'
        'ⅾ'
        '𝒹'
        '𝙙'
    ==
  ::  +con-e: confusable with 'e'
  ++  con-e
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝓮'
        '𝚎'
        'e'
        'ｅ'
        '𝑒'
        '𝗲'
        'ⅇ'
        '𝒆'
        '𝘦'
        '℮'
        '𝖊'
        'ℯ'
        '𝐞'
        '𝖾'
        'ꬲ'
        'е'
        '𝔢'
        '𝕖'
        'ҽ'
        '𝙚'
    ==
  ::  +con-f: confusable with 'f'
  ++  con-f
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝓯'
        '𝚏'
        'ք'
        '𝑓'
        '𝗳'
        'f'
        '𝒇'
        '𝘧'
        '𝖋'
        '𝐟'
        '𝖿'
        '𝔣'
        'ꬵ'
        '𝕗'
        'ꞙ'
        '𝒻'
        '𝙛'
        'ẝ'
        'ſ'
    ==
  ::  +con-g: confusable with 'g'
  ++  con-g
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝓰'
        '𝚐'
        'ɡ'
        'ց'
        'ᶃ'
        '𝑔'
        '𝗴'
        'g'
        'ｇ'
        '𝒈'
        '𝘨'
        'ℊ'
        '𝖌'
        'ƍ'
        '𝐠'
        '𝗀'
        '𝔤'
        '𝕘'
        '𝙜'
    ==
  ::  +con-h: confusable with 'h'
  ++  con-h
    ^~
    ^-  (set @t)
    %-  silt
    :~  'Ꮒ'
        '𝖍'
        '𝓱'
        '𝚑'
        'h'
        'ｈ'
        '𝔥'
        'ℎ'
        '𝒉'
        '𝘩'
        'հ'
        '𝒽'
        '𝙝'
        '𝐡'
        '𝗁'
        '𝗵'
        'һ'
        '𝕙'
    ==
  ::  +con-i: confusable with 'i'
  ++  con-i
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝓲'
        '𝞲'
        'ꙇ'
        'ⅈ'
        'ｉ'
        '𝔦'
        '𝘪'
        'ӏ'
        '𝙞'
        '𝚤'
        '𝐢'
        'і'
        '𝑖'
        '˛'
        '𝕚'
        '𝖎'
        'Ꭵ'
        '𝚒'
        '𑣃'
        'i'
        'ɩ'
        'ɪ'
        '𝒊'
        '𝛊'
        'ⅰ'
        'ı'
        '𝒾'
        '𝜾'
        '⍳'
        '𝜄'
        'ꭵ'
        '𝗂'
        '𝝸'
        'ℹ'
        'ι'
        '𝗶'
        'ͺ'
    ==
  ::  +con-j: confusable with 'j'
  ++  con-j
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝖏'
        '𝓳'
        '𝚓'
        'ⅉ'
        '𝔧'
        'j'
        'ｊ'
        '𝒋'
        '𝘫'
        '𝒿'
        '𝙟'
        'ϳ'
        '𝐣'
        '𝗃'
        'ј'
        '𝑗'
        '𝗷'
        '𝕛'
    ==
  ::  +con-k: confusable with 'k'
  ++  con-k
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝖐'
        '𝓴'
        '𝚔'
        '𝔨'
        'k'
        '𝒌'
        '𝘬'
        '𝓀'
        '𝙠'
        '𝐤'
        '𝗄'
        '𝑘'
        '𝗸'
        '𝕜'
    ==
  ::  +con-l: confusable with 'l'
  ++  con-l
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝚰'
        '𝘭'
        'І'
        '𝖨'
        '𝐥'
        'ﺍ'
        'ﺎ'
        '𝔩'
        'ℐ'
        'ℑ'
        '𐊊'
        'Ⲓ'
        '𐌉'
        'ℓ'
        '𝜤'
        'Ɩ'
        '𝞘'
        'Ι'
        '𝚕'
        '𝟏'
        '∣'
        'ا'
        'Ｉ'
        '𝗅'
        '𝕀'
        '1'
        '𝙄'
        '𝓁'
        '𐌠'
        '𝐼'
        '𞸀'
        '𞺀'
        '׀'
        '𝑰'
        'ǀ'
        'Ӏ'
        'ᛁ'
        '𝟭'
        '𝕴'
        'I'
        'ߊ'
        'ｌ'
        '𝛪'
        'ⵏ'
        '𝝞'
        '𝕝'
        '𝟣'
        'ו'
        '𞣇'
        '𝙡'
        '𝓘'
        '𝗜'
        '𝟙'
        '𝑙'
        'ן'
        'Ⅰ'
        '𝘐'
        '١'
        '𝒍'
        '𝖑'
        '￨'
        '🯱'
        '𝐈'
        'l'
        '۱'
        'ꓲ'
        '𖼨'
        '𝙸'
        '𝟷'
        '𝓵'
        '|'
        'ⅼ'
        '⏽'
        '𝗹'
    ==
  ::  +con-m: confusable with 'm'
  ++  con-m
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𑜀'
        '𝒎'
        '𝘮'
        '𑣣'
        '𝖒'
        '𝐦'
        '𝗆'
        'm'
        '𝔪'
        '𝕞'
        '𝓂'
        '𝙢'
        '𝓶'
        '𝚖'
        'r'
        'n'
        '𝑚'
        '𝗺'
        'ⅿ'
    ==
  ::  +con-n: confusable with 'n'
  ++  con-n
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝒏'
        '𝘯'
        '𝖓'
        '𝐧'
        '𝗇'
        '𝔫'
        'n'
        '𝕟'
        '𝓃'
        '𝙣'
        'ո'
        '𝓷'
        '𝚗'
        'ռ'
        '𝑛'
        '𝗻'
    ==
  ::  +con-o: confusable with 'o'
  ++  con-o
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝘰'
        'ం'
        'ಂ'
        'ം'
        'ං'
        'օ'
        '𝐨'
        '𑣗'
        '𝔬'
        'ᴏ'
        'ᴑ'
        '𞹤'
        '𐓪'
        '𝚘'
        '𑣈'
        'ဝ'
        'ⲟ'
        '𝛐'
        'ഠ'
        '𝛔'
        'ﮦ'
        'ﮧ'
        '𝗈'
        '𝝈'
        'ﮨ'
        'ﮩ'
        'ﮪ'
        'ﮫ'
        'ﮬ'
        'ﮭ'
        '𞺄'
        'ℴ'
        '𝝄'
        '𝞸'
        '𝞼'
        'ꬽ'
        'о'
        'ھ'
        'ο'
        '၀'
        'ہ'
        'σ'
        'ه'
        'ｏ'
        '๐'
        '໐'
        '𝕠'
        '𐐬'
        '𞸤'
        '𝙤'
        'ە'
        '𝑜'
        '𝒐'
        'ס'
        '𝜎'
        '𝖔'
        '٥'
        '०'
        '੦'
        '૦'
        '௦'
        '౦'
        '೦'
        '൦'
        'ﻩ'
        'ﻪ'
        'ﻫ'
        'ﻬ'
        '𝜊'
        'o'
        '𝝾'
        '۵'
        '𝞂'
        '𝓸'
        '𝗼'
        'ჿ'
    ==
  ::  +con-p: confusable with 'p'
  ++  con-p
    ^~
    ^-  (set @t)
    %-  silt
    :~  'р'
        'ρ'
        '𝔭'
        '𝘱'
        '𝙥'
        '𝐩'
        'ｐ'
        '𝛠'
        '𝑝'
        '𝕡'
        '𝖕'
        '𝜚'
        '𝚙'
        '𝞎'
        'ⲣ'
        '𝝔'
        '𝛒'
        '𝒑'
        '𝟈'
        '𝝆'
        '𝓅'
        '𝜌'
        '𝗉'
        'p'
        '𝞀'
        'ϱ'
        '𝗽'
        '⍴'
        '𝞺'
        '𝓹'
    ==
  ::  +con-q: confusable with 'q'
  ++  con-q
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝔮'
        'գ'
        '𝒒'
        '𝘲'
        'զ'
        '𝓆'
        '𝙦'
        '𝐪'
        '𝗊'
        'q'
        '𝑞'
        '𝗾'
        '𝕢'
        '𝖖'
        'ԛ'
        '𝓺'
        '𝚚'
    ==
  ::  +con-r: confusable with 'r'
  ++  con-r
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝔯'
        'ꮁ'
        '𝒓'
        '𝘳'
        'ⲅ'
        'ᴦ'
        'ꭇ'
        'ꭈ'
        '𝓇'
        '𝙧'
        '𝐫'
        '𝗋'
        '𝑟'
        '𝗿'
        'r'
        'г'
        '𝕣'
        '𝖗'
        '𝓻'
        '𝚛'
    ==
  ::  +con-s: confusable with 's'
  ++  con-s
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝔰'
        '𑣁'
        '𝒔'
        '𝘴'
        '𝓈'
        '𝙨'
        'ꮪ'
        '𝐬'
        '𝗌'
        '𝑠'
        '𝘀'
        'ꜱ'
        's'
        'ｓ'
        '𝕤'
        'ѕ'
        '𝖘'
        '𝓼'
        '𝚜'
        '𐑈'
        'ƽ'
    ==
  ::  +con-t: confusable with 't'
  ++  con-t
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝐭'
        '𝗍'
        '𝔱'
        '𝕥'
        '𝓉'
        '𝙩'
        '𝓽'
        '𝚝'
        't'
        '𝑡'
        '𝘁'
        '𝒕'
        '𝘵'
        '𝖙'
    ==
  ::  +con-u: confusable with 'u'
  ++  con-u
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝐮'
        'υ'
        '𝔲'
        '𑣘'
        '𝕦'
        'ʋ'
        '𝙪'
        'ꭎ'
        '𐓶'
        '𝚞'
        'ꭒ'
        '𝑢'
        '𝒖'
        '𝛖'
        'ᴜ'
        '𝖚'
        'ꞟ'
        '𝜐'
        '𝗎'
        '𝓊'
        '𝝊'
        '𝓾'
        '𝞾'
        '𝞄'
        'u'
        '𝘂'
        '𝘶'
        'ս'
    ==
  ::  +con-v: confusable with 'v'
  ++  con-v
    ^~
    ^-  (set @t)
    %-  silt
    :~  '⋁'
        '𝐯'
        '𝔳'
        '𝕧'
        '𝙫'
        '𝚟'
        '𝑣'
        'ｖ'
        'ט'
        '𝒗'
        '𝖛'
        'ᴠ'
        '𝗏'
        '𑣀'
        '𝛎'
        '∨'
        '𝜈'
        'ꮩ'
        '𝓋'
        '𝓿'
        'ⅴ'
        '𝘃'
        'ѵ'
        'v'
        '𝝂'
        '𝘷'
        '𝞶'
        '𑜆'
        '𝝼'
        'ν'
    ==
  ::  +con-w: confusable with 'w'
  ++  con-w
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝐰'
        '𝗐'
        'ᴡ'
        'ѡ'
        'ա'
        'ꮃ'
        '𝔴'
        '𝕨'
        '𝓌'
        '𝙬'
        'ɯ'
        '𝔀'
        '𝚠'
        '𑜏'
        '𑜎'
        '𝑤'
        '𝘄'
        'w'
        '𝒘'
        '𝘸'
        '𝖜'
        'ԝ'
        '𑜊'
    ==
  ::  +con-x: confusable with 'x'
  ++  con-x
    ^~
    ^-  (set @t)
    %-  silt
    :~  'ᕁ'
        '𝓍'
        '𝙭'
        'х'
        '𝐱'
        '𝗑'
        '⤫'
        '𝑥'
        '𝘅'
        '⤬'
        '᙮'
        '⨯'
        '𝕩'
        '𝖝'
        '×'
        '𝔁'
        '𝚡'
        'x'
        'ｘ'
        'ⅹ'
        '𝔵'
        'ᕽ'
        '𝒙'
        '𝘹'
    ==
  ::  +con-y: confusable with 'y'
  ++  con-y
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝙮'
        'у'
        '𝐲'
        '𝝲'
        '𝑦'
        'ᶌ'
        '𝞬'
        '𑣜'
        '𝕪'
        'ʏ'
        '𝖞'
        '𝚢'
        'ｙ'
        'ꭚ'
        '𝒚'
        '𝓎'
        'ɣ'
        '𝗒'
        'ყ'
        '𝘆'
        'ү'
        '𝛾'
        'γ'
        '𝛄'
        '𝔂'
        '𝜸'
        'y'
        '𝔶'
        'ℽ'
        '𝘺'
        'ỿ'
    ==
  ::  +con-z: confusable with 'z'
  ++  con-z
    ^~
    ^-  (set @t)
    %-  silt
    :~  '𝓏'
        '𝙯'
        'ᴢ'
        '𝐳'
        '𝗓'
        '𑣄'
        '𝑧'
        '𝘇'
        '𝕫'
        '𝖟'
        'ꮓ'
        '𝔃'
        '𝚣'
        '𝔷'
        'z'
        '𝒛'
        '𝘻'
    ==
  ::  con-latin: latin confusables
  ++  con-latin
    ^~
    ^-  (list (pair @t (set @t)))
    :~  ['a' con-a]
        ['b' con-b]
        ['c' con-c]
        ['d' con-d]
        ['e' con-e]
        ['f' con-f]
        ['g' con-g]
        ['h' con-h]
        ['i' con-i]
        ['j' con-j]
        ['k' con-k]
        ['l' con-l]
        ['m' con-m]
        ['n' con-n]
        ['o' con-o]
        ['p' con-p]
        ['q' con-q]
        ['r' con-r]
        ['s' con-s]
        ['t' con-t]
        ['u' con-u]
        ['v' con-v]
        ['w' con-w]
        ['x' con-x]
        ['y' con-y]
        ['z' con-z]
  ==
  ::  +norm-latin-wide: normalize full-width latin character
  ::
  ++  norm-latin-wide
    |=  =@t
    ^-  @t
    =+  c=(taft t)
    ::  ascii wide characters are respresented in the
    ::  range U+FF01 - U+FF5E.
    ?.  &((gte c 0xff01) (lte c 0xff5e))  t
    (add (sub c 0xff00) 0x20)
  ::  +norm-latin: normalize latin character
  ::
  ++  norm-latin
    |=  c=@t
    ^-  @t
    =/  conf=(list (pair @t (set @t)))
      con-latin
    |-
    ?~  conf  c
    ?:  (~(has in q.i.conf) c)
      p.i.conf
    $(conf t.conf)
  ::  +norm-p: normalize a @p string
  ::
  ++  norm-p
    |=  txt=@t
    ^-  @t
    =|  norm=@t
    |-
    =+  len=(teff txt)
    =+  c=(end [3 len] txt)
    ?:  =('' c)  norm
    =/  n=@t
      ?:  (~(has in con-sig) c)  '~'
      ?:  (~(has in con-hep) c)  '-'
      (norm-latin-wide (norm-latin c))
    $(norm (cat 3 norm n), txt (rsh [3 len] txt))
  --
--
